run/constEvaporation/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          icoPhaseChangeVoF;

startFrom       startTime;

startTime       0;

stopAt          endTime;
stopAt          nextWrite;

endTime         100e-6;

deltaT          1e-8;

writeControl    adjustableRunTime;

writeInterval   1e-8;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.2;
maxAlphaCo      0.2;
maxDiCo         5.0;

maxDeltaT       1e-6;


// ************************************************************************* //

DebugSwitches
{
    MULES           1;
    evaporationModel 1;
}

OptimisationSwitches
{
    fileHandler collated;
}

functions
{
    divU
    {
        type            div;
        libs            ("libfieldFunctionObjects.so");

        writeControl    writeTime;

        writeFields     false;

        regionType      all;

        result          divU;

        field           phi;
    }

    maxValue
    {
        type            volFieldValue;

        libs            ("libfieldFunctionObjects.so");

        log             true;

        writeControl    writeTime;

        writeFields     false;

        regionType      all;

        cellZone        all;

        operation       max;

        fields (p_rgh T divU);
    }

    minValue
    {
        type            volFieldValue;

        libs            ("libfieldFunctionObjects.so");

        log             true;

        writeControl    writeTime;

        writeFields     false;

        regionType      all;

        cellZone        all;

        operation       min;

        fields (p_rgh T divU);
    }

    maxMagValue
    {
        type            volFieldValue;

        libs            ("libfieldFunctionObjects.so");

        log             true;

        writeControl    writeTime;

        writeFields     false;

        regionType      all;

        cellZone        all;

        operation       maxMag;

        fields (U);
    }
}